In [27]:
import pandas as pd
import numpy as np

In [7]:
# Reading the data

user_col_names = ["UserID", "Gender", "Age", "Occupation", "Zipcode"]
udf = pd.read_csv("ml-1m/users.dat", sep="::", header=None, names=user_col_names, engine="python")

movies_col_names = ["MovieID", "Title", "Genres"]
mdf = pd.read_csv("ml-1m/movies.dat", sep="::", header=None, names=movies_col_names, engine="python")

ratings_col_names = ["UserID", "MovieID", "Rating", "Timestamp"]
rdf = pd.read_csv("ml-1m/ratings.dat", sep="::", header=None, names=ratings_col_names, engine="python")

In [8]:
udf.head()

   UserID Gender  Age  Occupation Zipcode
0       1      F    1          10   48067
1       2      M   56          16   70072
2       3      M   25          15   55117
3       4      M   45           7   02460
4       5      M   25          20   55455

In [12]:
udf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6040 entries, 0 to 6039
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   UserID      6040 non-null   int64
 1   Gender      6040 non-null   object
 2   Age         6040 non-null   int64
 3   Occupation  6040 non-null   int64
 4   Zipcode     6040 non-null   object
dtypes: int64(3), object(2)
memory usage: 236.1+ KB

In [10]:
mdf.head()

   MovieID                               Title                        Genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

In [13]:
mdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3883 entries, 0 to 3882
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   MovieID  3883 non-null   int64
 1   Title    3883 non-null   object
 2   Genres   3883 non-null   object
dtypes: int64(1), object(2)
memory usage: 91.1+ KB

In [11]:
rdf.head()

   UserID  MovieID  Rating  Timestamp
0       1     1193       5  978300760
1       1      661       3  978302109
2       1      914       3  978301968
3       1     3408       4  978300275
4       1     2355       5  978824291

In [14]:
rdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000209 entries, 0 to 1000208
Data columns (total 4 columns):
 #   Column     Non-Null Count    Dtype
---  ------     --------------    -----
 0   UserID     1000209 non-null  int64
 1   MovieID    1000209 non-null  int64
 2   Rating     1000209 non-null  int64
 3   Timestamp  1000209 non-null  int64
dtypes: int64(4)
memory usage: 30.5 MB

In [17]:
R_global = rdf.Rating.mean()
R_global

3.581564453029317

In [31]:
res = rdf.loc[rdf.MovieID == -1].Rating.mean()
res

nan

In [32]:
type(res)

float

In [38]:
rdf.loc[rdf.MovieID == ]

        UserID  MovieID  Rating  Timestamp
40           1        1       5  978824268
469          6        1       4  978237008
581          8        1       4  978233496
711          9        1       5  978225952
837         10        1       5  978226474
...        ...      ...     ...        ...
997248    6022        1       5  956755763
997541    6025        1       5  956812867
998170    6032        1       4  956718127
998360    6035        1       4  956712849
999870    6040        1       3  957717358

[2077 rows x 4 columns]

In [ ]:
def R_item(item):
    filtered = rdf.loc[rdf.MovieID == item]
    if len(filtered) == 0:
        """The item is not in our database"""
        
    


R_item = lambda x: rdf.loc[rdf.MovieID == rdf]